app/controllers/bathrooms_controller.rb

  def index
    @bathrooms = Bathroom.all
---
SELECT "bathrooms".* FROM "bathrooms"

  def create
    @bathroom = @neighborhood.bathrooms.build(bathroom_params)
    if @bathroom.save
---
INSERT INTO "bathrooms" ("location", "address", "description", "neighborhood_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["location", ""], ["address", ""], ["description", ""], ["neighborhood_id", 1], ["created_at", "2015-06-05 22:31:08.737077"], ["updated_at", "2015-06-05 22:31:08.737077"]]

  def set_neighborhood
    @neighborhood = Neighborhood.find(params[:neighborhood_id])
---
SELECT  "neighborhoods".* FROM "neighborhoods" WHERE "neighborhoods"."id" = $1 LIMIT 1  [["id", nil]]