app/controllers/neighborhoods_controller.rb

SELECT "neighborhoods".* FROM "neighborhoods"
---
  def index
    @neighborhoods = Neighborhood.all

SELECT  "neighborhoods".* FROM "neighborhoods" WHERE "neighborhoods"."id" = $1 LIMIT 1  [["id", 0]]
---
  def show
    @neighborhood = Neighborhood.find(params[:id])